src/main/resources/ws_soap_requests/NodeGpsGet_ID.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Header>
    <Credentials xmlns="http://Airspan.Netspan.WebServices">
      <Username>wsadmin</Username>
      <Password>password</Password>
    </Credentials>
  </soap:Header>
  <soap:Body>
    <NodeGpsGet xmlns="http://Airspan.Netspan.WebServices">
      <NodeNameOrId>EnbID</NodeNameOrId>
    </NodeGpsGet>
  </soap:Body>
</soap:Envelope>
